Лабораторная работа № 0. Аргументы командной строки и переменные окружения.

Постановка задачи
-----------------

Требуется написать программу на языке программирования C, выполняющую следующие действия:

1. Вывод аргументов командной строки, включая имя программы, в формате
Argv[номер_аргумента]=значение_аргумента
2. Вывод переменных окружения процесса в формате
имя_переменной_окружения=значение_переменной_окружения

Дополнительные требования
-------------------------

1. В программе могут использоваться вызовы функции printf().
2. Программа должна использовать аргументы вызова функции int main(int argc, char* argv[], char** env).


Дополнения и замечания
----------------------
1. Лабораторная работа размещена по адресу \\S-FILE2\globaltemp\OperatingSystems\ПМИ\OS-Lab0
2. В виртуальной машине вы можете работать под учетной записью root (пароль root).
3. Для редактирования можно использовать встроенный редактор Midnight Commander (вызывается по F4).
4. Для комипляции и линковки можно использовать командную строку следующего вида:

   cc  -o  имя_исполняемого_файла  имя_файла_исходного_кода

   например:   cc  -o  myprog  p01.c
   
5. Для запуска программы следует использовать командную строку следующего вида:

   ./myprog аргумент1 аргумент2 ...
